src/main/resources/templates/xml/currency_conversion_request.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:web="http://www.webserviceX.NET/"
    xmlns:th="http://www.thymeleaf.org">
    <soapenv:Header/>
    <soapenv:Body>
        <web:ConversionRate>
            <web:FromCurrency th:text="${from_currency}"></web:FromCurrency>
            <web:ToCurrency th:text="${to_currency}"></web:ToCurrency>
        </web:ConversionRate>
    </soapenv:Body>
</soapenv:Envelope>
